app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "New user"], ["email", "This is a email user."], ["created_at", "2023-12-01 09:47:35.681139"], ["updated_at", "2023-12-01 09:47:35.681139"]]

  def destroy

    if @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]